package homework_12_08_2022;

// 2)Задача заключается в следующем.
// Имеется три стержня — левый, средний и правый.
// На левом стержне находятся n дисков, диаметры которых различны.
// Диски упорядочены по размеру диаметра, сверху лежит наименьший, снизу — наибольший.
// Требуется перенести диски с левого стержня на правый, используя средний стержень как вспомогательный.
// Головоломка имеет следующие два правила:
// 1. Вы не можете поместить больший диск на меньший диск.
// 2. За один раз можно перемещать только один диск.
// Задача  - придумать и описать алгоритм. Можно текстом, можно псевдокодом.

public class Main1 {
/*
Переложить диск или с левого стержня на средний и с левого на правый, в зависимости от того, где он меньше.
Со среднего на правый. С левого на средний. С правого на левый. С правого на средний. Потом с левого на средний.
Затем с левого на правый.
Тогда, чтобы решить головоломку с чётным количеством дисков, надо многократно повторять действия: 1-2, 1-3, 2-3.
Если число дисков нечётно - 1-3, 1-2, 2-3.
*/

}
